# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
httml = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'
baby_names = pd.read_csv(httml)
baby_names.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Unnamed: 0</th>
      <th>Id</th>
      <th>Name</th>
      <th>Year</th>
      <th>Gender</th>
      <th>State</th>
      <th>Count</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>11349</td>
      <td>11350</td>
      <td>Emma</td>
      <td>2004</td>
      <td>F</td>
      <td>AK</td>
      <td>62</td>
    </tr>
    <tr>
      <th>1</th>
      <td>11350</td>
      <td>11351</td>
      <td>Madison</td>
      <td>2004</td>
      <td>F</td>
      <td>AK</td>
      <td>48</td>
    </tr>
    <tr>
      <th>2</th>
      <td>11351</td>
      <td>11352</td>
      <td>Hannah</td>
      <td>2004</td>
      <td>F</td>
      <td>AK</td>
      <td>46</td>
    </tr>
    <tr>
      <th>3</th>
      <td>11352</td>
      <td>11353</td>
      <td>Grace</td>
      <td>2004</td>
      <td>F</td>
      <td>AK</td>
      <td>44</td>
    </tr>
    <tr>
      <th>4</th>
      <td>11353</td>
      <td>11354</td>
      <td>Emily</td>
      <td>2004</td>
      <td>F</td>
      <td>AK</td>
      <td>41</td>
    </tr>
  </tbody>
</table>
</div>

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Unnamed: 0</th>
      <th>Id</th>
      <th>Name</th>
      <th>Year</th>
      <th>Gender</th>
      <th>State</th>
      <th>Count</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>11349</td>
      <td>11350</td>
      <td>Emma</td>
      <td>2004</td>
      <td>F</td>
      <td>AK</td>
      <td>62</td>
    </tr>
    <tr>
      <th>1</th>
      <td>11350</td>
      <td>11351</td>
      <td>Madison</td>
      <td>2004</td>
      <td>F</td>
      <td>AK</td>
      <td>48</td>
    </tr>
    <tr>
      <th>2</th>
      <td>11351</td>
      <td>11352</td>
      <td>Hannah</td>
      <td>2004</td>
      <td>F</td>
      <td>AK</td>
      <td>46</td>
    </tr>
    <tr>
      <th>3</th>
      <td>11352</td>
      <td>11353</td>
      <td>Grace</td>
      <td>2004</td>
      <td>F</td>
      <td>AK</td>
      <td>44</td>
    </tr>
    <tr>
      <th>4</th>
      <td>11353</td>
      <td>11354</td>
      <td>Emily</td>
      <td>2004</td>
      <td>F</td>
      <td>AK</td>
      <td>41</td>
    </tr>
    <tr>
      <th>5</th>
      <td>11354</td>
      <td>11355</td>
      <td>Abigail</td>
      <td>2004</td>
      <td>F</td>
      <td>AK</td>
      <td>37</td>
    </tr>
    <tr>
      <th>6</th>
      <td>11355</td>
      <td>11356</td>
      <td>Olivia</td>
      <td>2004</td>
      <td>F</td>
      <td>AK</td>
      <td>33</td>
    </tr>
    <tr>
      <th>7</th>
      <td>11356</td>
      <td>11357</td>
      <td>Isabella</td>
      <td>2004</td>
      <td>F</td>
      <td>AK</td>
      <td>30</td>
    </tr>
    <tr>
      <th>8</th>
      <td>11357</td>
      <td>11358</td>
      <td>Alyssa</td>
      <td>2004</td>
      <td>F</td>
      <td>AK</td>
      <td>29</td>
    </tr>
    <tr>
      <th>9</th>
      <td>11358</td>
      <td>11359</td>
      <td>Sophia</td>
      <td>2004</td>
      <td>F</td>
      <td>AK</td>
      <td>28</td>
    </tr>
  </tbody>
</table>
</div>

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
baby_names.drop(['Unnamed: 0', 'Id'], axis=1, inplace=True)

### Step 6. Is there more male or female names in the dataset?

In [12]:
baby_names.Gender.value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [16]:
names = baby_names.groupby('Name').Count.sum()
names

Name
Aaban            12
Aadan            23
Aadarsh           5
Aaden          3426
Aadhav            6
Aadhya          453
Aadi            307
Aadin             5
Aadit            18
Aaditya          97
Aadya           300
Aadyn            69
Aahan            14
Aahana          124
Aahil           115
Aahna             7
Aaiden          170
Aaima             5
Aakash          123
Aalaya            5
Aalayah          99
Aaleah           10
Aaleyah         262
Aalia            51
Aaliah          206
Aalijah          15
Aaliya          288
Aaliyah       48306
Aaliyha          21
Aalyah          123
              ...
Zyir             25
Zyire             5
Zykeria         416
Zykeriah          5
Zykerria         36
Zykia            31
Zykierra          5
Zykira           14
Zykiria          11
Zyla            106
Zylah            62
Zylan            22
Zylen            12
Zyler           171
Zymari            5
Zymarion         15
Zymere          100
Zymier           16
Zymiere          15
Zymir           321
Zymire           10
Zyon           1186
Zyonna           61
Zyquan           42
Zyquavious        6
Zyra             42
Zyrah            11
Zyren             6
Zyria            59
Zyriah           58
Name: Count, Length: 17632, dtype: int64

### Step 8. How many different names exist in the dataset?

In [20]:
len(baby_names.Name.unique())
# or because we already grouped it by NAme
len(names)
names.count()

17632

### Step 9. What is the name with most occurrences?

In [30]:
names.idxmax()
names.sort_values(ascending=False).head(1)

Name
Jacob    242874
Name: Count, dtype: int64

### Step 10. How many different names have the least occurrences?

In [33]:
mino = names.min()
names[names == mino].count()

2578

### Step 11. What is the median name occurrence?

In [35]:
mediano =  names.median()
names[names == mediano]

Name
Aishani       49
Alara         49
Alysse        49
Ameir         49
Anely         49
Antonina      49
Aveline       49
Aziah         49
Baily         49
Caleah        49
Carlota       49
Cristine      49
Dahlila       49
Darvin        49
Deante        49
Deserae       49
Devean        49
Elizah        49
Emmaly        49
Emmanuela     49
Envy          49
Esli          49
Fay           49
Gurshaan      49
Hareem        49
Iven          49
Jaice         49
Jaiyana       49
Jamiracle     49
Jelissa       49
              ..
Kyndle        49
Kynsley       49
Leylanie      49
Maisha        49
Malillany     49
Mariann       49
Marquell      49
Maurilio      49
Mckynzie      49
Mehdi         49
Nabeel        49
Nalleli       49
Nassir        49
Nazier        49
Nishant       49
Rebecka       49
Reghan        49
Ridwan        49
Riot          49
Rubin         49
Ryatt         49
Sameera       49
Sanjuanita    49
Shalyn        49
Skylie        49
Sriram        49
Trinton       49
Vita          49
Yoni          49
Zuleima       49
Name: Count, Length: 66, dtype: int64

### Step 12. What is the standard deviation of names?

In [36]:
names.std()

11006.06946789057

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [37]:
names.describe()

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64